app/controllers/short_urls_controller.rb

  def index
    urls = ShortUrl.order(click_count: :desc).limit(100)
    render status: 200, json: { urls: urls.map{ |u| u.short_code } }
---
SELECT `short_urls`.* FROM `short_urls` ORDER BY `short_urls`.`click_count` DESC LIMIT 100
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`short_url` IS NULL LIMIT 1

  def create
    # Checks if url is already added
    shortUrl = ShortUrl.find_by_full_url(params[:full_url])
    if shortUrl
      # Render short_code from a located full_url on DB
      render json: {short_code:shortUrl.short_code}, status: 200
    else
      # New intance ShortUrl
      shortUrl = ShortUrl.new(full_url:params[:full_url])
      if shortUrl.save
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`full_url` = 'nope!' LIMIT 1
INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('https://www.twitch.tv/', '2022-10-29 12:33:25.072274', '2022-10-29 12:33:25.072274')
UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2022-10-29 11:19:33.488081' WHERE `short_urls`.`id` = 16

  def show
    # Find the full url associate
    shortUrl = ShortUrl.find_by_short_code(params[:id])
    if shortUrl
      # Increase by 1 click_count
      shortUrl.update_attribute(:click_count, shortUrl.click_count + 1)
---
UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2022-10-30 07:07:06.754623' WHERE `short_urls`.`id` = 4