app/models/short_url.rb

  def update_title!
    uri = URI.parse(full_url)
    body = Net::HTTP.get(uri)
    title = body.match(/<title.*?>(.*)<\/title>/)[1]
    self.update(title: title) unless title.empty?
---
UPDATE `short_urls` SET `short_urls`.`title` = 'Facebook - Inicia sesión o regístrate', `short_urls`.`updated_at` = '2022-10-30 07:05:39.294167' WHERE `short_urls`.`id` = 4

  def self.find_by_short_code(code)
    ShortUrl.find_by_short_url(code)
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`short_url` = '4' LIMIT 1