app/jobs/update_title_job.rb

  def perform(short_url_id)
    short_url = ShortUrl.find_by_id(shortUrl_id)
    short_url.update_title!
---
SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 1004 LIMIT 1
UPDATE `short_urls` SET `short_urls`.`title` = 'Discord | Your Place to Talk and Hang Out' WHERE `short_urls`.`id` = 1012